[
  {
    "id": "123e4567-e89b-12d3-a456-426614174000",
    "title": "The Life and Adventures of Robinson Crusoe by Daniel Defoe",
    "cnTitle": "鲁滨逊漂流记",
    "author": "Daniel Defoe",
    "cover": "./books/The Life and Adventures of Robinson Crusoe by Daniel Defoe/cover.jpg",
    "difficulty": "Intermediate",
    "description": "The Life and Adventures of Robinson Crusoe is the story of the title character, Robinson Crusoe, an Englishman who goes on a long sea voyage to the Caribbean and then to the South Pacific. He is shipwrecked on a deserted island and survives there for many years, until he is rescued by a passing ship.",
    "epubUrl": "./books/The Life and Adventures of Robinson Crusoe by Daniel Defoe/hints.epub",
    "wordsUrl": "./books/The Life and Adventures of Robinson Crusoe by Daniel Defoe/hard-words.json"
  },
  {
    "id": "123e4567-e89b-12d3-a456-426614174002",
    "title": "The Time Machine by H. G. Wells",
    "cnTitle": "时间旅行",
    "author": "H. G. Wells",
    "cover": "./books/The Time Machine by H. G. Wells/cover.jpg",
    "difficulty": "Easy",
    "description": "The Time Machine by H. G. Wells is a science fiction novel written in the late 19th century. The story introduces a brilliant Time Traveller who presents his revolutionary ideas about time and space to a group of skeptical friends, discussing the concept of a fourth dimension that intertwines with our understanding of time. The opening portion reveals the Time Traveller engaging his guests in a lively conversation about his theories of time travel, demonstrating his intellect and confidence. He showcases a small model of the time machine he has created, which he explains will allow him to journey through time. His companions express disbelief and skepticism regarding his claims, leading to a tense yet intriguing atmosphere. As the narrative progresses, the Time Traveller prepares for an actual demonstration of his invention, setting the stage for his soon-to-be incredible journey into both the past and the future. ",
    "epubUrl": "./books/The Time Machine by H. G. Wells/hints.epub",
    "wordsUrl": "./books/The Time Machine by H. G. Wells/hard-words.json"
  },
  {
    "id": "123e4567-e89b-12d3-a456-426614174003",
    "title": "Alice's Adventures in Wonderland by Lewis Carroll",
    "cnTitle": "爱丽丝梦游仙境",
    "author": "Lewis Carroll",
    "cover": "./books/Alice's Adventures in Wonderland by Lewis Carroll/cover.jpg",
    "difficulty": "Easy",
    "description": "Alice's Adventures in Wonderland by Lewis Carroll is a classic children's novel written in the mid-19th century. The story follows a young girl named Alice who, feeling bored and sleepy while sitting by a riverbank, encounters a White Rabbit and follows it down a rabbit hole, plunging into a fantastical world filled with curious creatures and whimsical adventures. The opening of the book introduces Alice as she daydreams about her surroundings before spotting the White Rabbit, who is both flustered and animated. Curious, Alice pursues the Rabbit and finds herself tumbling down a deep rabbit hole, leading to a curious hall filled with doors, all locked. After experiencing a series of bizarre changes in size from eating and drinking mysterious substances, she begins exploring this new world, initially frustrated by her newfound challenges as she navigates her size and the peculiar inhabitants she meets. The narrative sets the tone for Alice's whimsical and often nonsensical adventures that characterize the entire tale. ",
    "epubUrl": "./books/Alice's Adventures in Wonderland by Lewis Carroll/origin.epub",
    "wordsUrl": "./books/Alice's Adventures in Wonderland by Lewis Carroll/hard-words.json"
  },
  {
    "id": "123e4567-e89b-12d3-a456-426614174001",
    "title": "Pride and Prejudice by Jane Austen",
    "cnTitle": "傲慢和偏见",
    "author": "Jane Austen",
    "cover": "./books/Pride and Prejudice by Jane Austen/cover.jpg",
    "difficulty": "Intermediate",
    "description": "Pride and Prejudice by Jane Austen is a classic novel written in the early 19th century. The story delves into themes of love, social class, and individual agency, largely revolving around the life of Elizabeth Bennet, one of five sisters from a modest but genteel family navigating the complex social landscape of Regency England. The opening of the novel introduces the seemingly universal truth that a single man of wealth is a target for matchmaking mothers in the neighborhood. Mrs. Bennet is eager to marry off her daughters and is excited to hear about the arrival of Mr. Bingley, a wealthy young man who has taken up residence at Netherfield Park. Mr. Bennet's teasing yet indifferent nature contrasts sharply with Mrs. Bennet's anxious and businesslike demeanor as she plans to visit Mr. Bingley to create an opportunity for her daughters. Their witty exchanges set the tone for the story's exploration of family dynamics and social expectations, while also hinting at deeper character developments and the challenges Elizabeth will face regarding love and prejudice in her interactions with Mr. Darcy and the Bingley family. ",
    "epubUrl": "./books/Pride and Prejudice by Jane Austen/hints.epub",
    "wordsUrl": "./books/Pride and Prejudice by Jane Austen/hard-words.json"
  }
]