[
  {
    "id": "123e4567-e89b-12d3-a456-426614174000",
    "title": "The Life and Adventures of Robinson Crusoe by Daniel Defoe",
    "cnTitle": "鲁滨逊漂流记",
    "author": "Daniel Defoe",
    "cover": "./books/The Life and Adventures of Robinson Crusoe by Daniel Defoe/cover.jpg",
    "difficulty": "Intermediate",
    "description": "The Life and Adventures of Robinson Crusoe is the story of the title character, Robinson Crusoe, an Englishman who goes on a long sea voyage to the Caribbean and then to the South Pacific. He is shipwrecked on a deserted island and survives there for many years, until he is rescued by a passing ship.",
    "epubUrl": "./books/The Life and Adventures of Robinson Crusoe by Daniel Defoe/hints.epub",
    "wordsUrl": "./books/The Life and Adventures of Robinson Crusoe by Daniel Defoe/hard-words.json"
  },
  {
    "id": "123e4567-e89b-12d3-a456-426614174002",
    "title": "The Time Machine by H. G. Wells",
    "cnTitle": "时间旅行",
    "author": "H. G. Wells",
    "cover": "./books/The Time Machine by H. G. Wells/cover.jpg",
    "difficulty": "Easy",
    "description": "The Time Machine by H. G. Wells is a science fiction novel written in the late 19th century. The story introduces a brilliant Time Traveller who presents his revolutionary ideas about time and space to a group of skeptical friends, discussing the concept of a fourth dimension that intertwines with our understanding of time. The opening portion reveals the Time Traveller engaging his guests in a lively conversation about his theories of time travel, demonstrating his intellect and confidence. He showcases a small model of the time machine he has created, which he explains will allow him to journey through time. His companions express disbelief and skepticism regarding his claims, leading to a tense yet intriguing atmosphere. As the narrative progresses, the Time Traveller prepares for an actual demonstration of his invention, setting the stage for his soon-to-be incredible journey into both the past and the future. ",
    "epubUrl": "./books/The Time Machine by H. G. Wells/hints.epub",
    "wordsUrl": "./books/The Time Machine by H. G. Wells/hard-words.json"
  },
  {
    "id": "123e4567-e89b-12d3-a456-426614174003",
    "title": "Alice's Adventures in Wonderland by Lewis Carroll",
    "cnTitle": "爱丽丝梦游仙境",
    "author": "Lewis Carroll",
    "cover": "./books/Alice's Adventures in Wonderland by Lewis Carroll/cover.jpg",
    "difficulty": "Easy",
    "description": "Alice's Adventures in Wonderland by Lewis Carroll is a classic children's novel written in the mid-19th century. The story follows a young girl named Alice who, feeling bored and sleepy while sitting by a riverbank, encounters a White Rabbit and follows it down a rabbit hole, plunging into a fantastical world filled with curious creatures and whimsical adventures. The opening of the book introduces Alice as she daydreams about her surroundings before spotting the White Rabbit, who is both flustered and animated. Curious, Alice pursues the Rabbit and finds herself tumbling down a deep rabbit hole, leading to a curious hall filled with doors, all locked. After experiencing a series of bizarre changes in size from eating and drinking mysterious substances, she begins exploring this new world, initially frustrated by her newfound challenges as she navigates her size and the peculiar inhabitants she meets. The narrative sets the tone for Alice's whimsical and often nonsensical adventures that characterize the entire tale. ",
    "epubUrl": "./books/Alice's Adventures in Wonderland by Lewis Carroll/hints.epub",
    "wordsUrl": "./books/Alice's Adventures in Wonderland by Lewis Carroll/hard-words.json"
  },
  {
    "id": "123e4567-e89b-12d3-a456-426614174004",
    "title": "A Journey to the Centre of the Earth by Jules Verne",
    "cnTitle": "地心游记",
    "author": "Jules Verne",
    "cover": "./books/A Journey to the Centre of the Earth by Jules Verne/cover.jpg",
    "difficulty": "Easy",
    "description": "A Journey to the Centre of the Earth by Jules Verne is a science fiction novel written in the mid-19th century. The story follows the protagonist, Professor Otto Lidenbrock, and his nephew, Axel, as they embark on an extraordinary expedition to explore the depths of the Earth, spurred by an ancient manuscript that hints at the path to the planet's core. The novel combines adventure with scientific exploration, drawing upon the geological knowledge of its time. The opening of the book introduces us to the eccentric Professor Lidenbrock, who is consumed by a recent discovery of a Runic manuscript he believes contains secrets to the Earth's interior. The story begins in Germany, where he summons his nephew, Axel, to help decipher the text, leading to a mix of excitement and dread as the young man grapples with the implications of their potential journey. As the chapters progress, Lidenbrock's fervor and determination become apparent, setting the stage for their thrilling and perilous adventure below ground. The narrative introduces key characters, references to Iceland's geological wonders, and hints at the challenges they will face as they prepare for their ambitious descent.  ",
    "epubUrl": "./books/A Journey to the Centre of the Earth by Jules Verne/hints.epub",
    "wordsUrl": "./books/A Journey to the Centre of the Earth by Jules Verne/hard-words.json"
  },
  {
    "id": "123e4567-e89b-12d3-a456-426614174005",
    "title": "The Great Gatsby by F. Scott Fitzgerald",
    "cnTitle": "了不起的盖茨比",
    "author": "Scott Fitzgerald",
    "cover": "./books/The Great Gatsby by F. Scott Fitzgerald/cover.jpg",
    "difficulty": "Easy",
    "description": "The Great Gatsby by F. Scott Fitzgerald is a novel written in the early 20th century. The story is mainly narrated by Nick Carraway, who reflects on the life of his enigmatic neighbor, Jay Gatsby, and the extravagant world of wealth and excess he inhabits. The novel explores themes of the American Dream, love, and social class. At the start of the novel, Nick Carraway reflects on advice from his father about withholding judgment of others, which sets the stage for the unfolding narrative. We learn about Nick's background, his move to West Egg, and his connection to wealthy acquaintances like Tom and Daisy Buchanan. Nick's first glimpse of Gatsby is during a moment of solitude when he sees Gatsby reaching out toward a distant green light, symbolizing his unattainable dreams. This opening portion lays the groundwork for the intricate relationships and social dynamics in the world of 1920s America, hinting at the luxurious yet hollow lives that many characters lead. ",
    "epubUrl": "./books/The Great Gatsby by F. Scott Fitzgerald/hints.epub",
    "wordsUrl": "./books/The Great Gatsby by F. Scott Fitzgerald/hard-words.json"
  },
  {
    "id": "123e4567-e89b-12d3-a456-426614174006",
    "title": "The Lost World by Arthur Conan Doyle",
    "cnTitle": "迷失的世界",
    "author": "Arthur Conan Doyle",
    "cover": "./books/The Lost World by Arthur Conan Doyle/cover.jpg",
    "difficulty": "Easy",
    "description": "The Lost World by Sir Arthur Conan Doyle is a novel written in the early 20th century. The story revolves around the ambitious Edward Malone, who seeks to prove himself worthy of love from Gladys, a woman who craves a partner capable of grand adventures. His quest for heroism leads him to an encounter with Professor Challenger, who claims to have discovered a prehistoric land filled with extraordinary creatures. The opening of the book introduces Edward Malone as he navigates a frustrating conversation with Gladys' father, Mr. Hungerton, and builds suspense as he prepares to propose to her. However, Gladys reveals her desire for a more adventurous man, which motivates Malone to seek out opportunities for heroism. This decision propels him into the world of Professor Challenger, who has returned from a mysterious expedition to South America filled with intriguing claims of dinosaurs and lost civilizations. The early chapters highlight Malone’s character, his interactions with Gladys, and set the stage for his subsequent adventures alongside Challenger and a team of explorers.",
    "epubUrl": "./books/The Lost World by Arthur Conan Doyle/hints.epub",
    "wordsUrl": "./books/The Lost World by Arthur Conan Doyle/hard-words.json"
  }
]